OpenROAD 26Q2-1994-g065077a742 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/asap7/lef/asap7_tech_1x_201209.lef, created 30 layers, 9 vias
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/asap7/lef/asap7sc7p5t_28_R_1x_220121a.lef, created 212 library cells
link_design tinyriscv
read_sdc ./results/asap7/tinyriscv/500mhzrun/1_2_yosys.sdc
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
eliminate_dead_logic
Removed 0 unused instances and 0 unused nets.
write_db ./results/asap7/tinyriscv/500mhzrun/1_synth.odb
write_sdc -no_timestamp ./results/asap7/tinyriscv/500mhzrun/1_synth.sdc
Elapsed time: 0:01.57[h:]min:sec. CPU time: user 1.43 sys 0.10 (97%). Peak memory: 253788KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
1_synth                   .odb            1            247 0eca576558116ecfe9e5
1_synth                   .sdc                             ca347c8ed019d34d8d5c
